pdxagc/F103_handwheel_control/STM32/DCDEMO7/src/main.c

#include "hmi_driver.h"
#include "hmi_user_uart.h"
#include "cmd_queue.h"
#include "cmd_process.h"
#include "stdio.h"
#include "hw_config.h"
#include "ulitity.h"
#include "string.h"
#include "flash.h"
#include "timer.h"
#include "exti.h"
#include "stdio.h"
#include "stm32f10x.h"
#include "stm32f10x_tim.h"
#include "tft.h"
#include "malloc.h"



volatile uint32  timer_tick_count = 0;               //定时器节拍
uint8  cmd_buffer[CMD_MAX_SIZE];                     //LCD指令缓存

uint8  TX_Data [30]; //the sending package    存储串口3要发送的数据（主程序发送）
uint8  RX_Data [30]; //the receiving package  接收串口3发来的数据（在中断中接收）

uint8  Work_Page_Status = 0;             //工作页面标记
uint8  get_cmd_type;                     //获取指令类型
uint8  get_ctrl_msg;                     //获取消息的类型
uint8  get_button_state;                 //获取按钮状态
uint8  get_control_type;                 //获取控件类型
uint16 get_screen_id;                    //获取画面ID
uint16 get_control_id;                   //获取控件ID
uint32 get_value;                        //获取数值
uint8  input_buf[20];                    //键盘输入内容

uint8  Press_button=0XFF;          //记录哪个按钮触发
uint8 last_time_work_state=0;      //记录上一次机器工作状态,默认是关机状态
uint16 Pulses_counter;              // 手轮脉冲数量
uint8 Override_num;                //倍率
uint8 first_time_re_workpiece;     //首次进入回工件零页面
uint8 Pulses_check=1;              //脉冲同步标志位
uint8 Pulses_count_mark=1;           //脉冲计数是能标记位
int32 Working_line;                //加工行数
uint8 Mark_10ms=0;                 //10ms计时标记位
uint8 Mark_10ms_Count;             //10ms计时溢出统计位
uint8 Mark_20ms=0;                 //20ms计时标记位
uint8 Mark_20ms_Count=0;           //20ms计时
uint8 Mark_60ms=0;                //100ms计时标记位

uint8 Cloud_File_Button=0;        //云空间文件选中按钮
uint8 SD_File_Button=0;           //SD卡文件选中按钮
uint8 Download_Per=0;             //已经下载百分比
uint8 Start_Download=0;           //开始下载标志位，0：没下载，1：正在下载
uint8 Cloud_Page=1;               //云空间页面
uint8 Last_time_Cloud_Page=0;
uint8 SD_Page=1;                  //SD卡页面
uint8 Last_time_SD_Page=0;
uint8 WiFi_Page=1;
uint8 Last_time_WiFi_Page=0;

uint8 Network_Control=4;   //0:无效，1：显示连接网络控件，2：隐藏连接网络控件，3：显示断开连接控件，4：隐藏断开连接控件
uint8 Sign_Control=4;      //0:无效，1：显示立即登录控件，2：隐藏立即登录控件，3：显示退出登录控件，4：隐藏退出登录控件
uint8 WiFi_Password_Right=0;  //网络密码正确
uint8 Account_Password_Right=0;//账户密码正确

uint8 file_name[20]="精雕佛像";    //文件名
char  Working_line_buf[20];        //保存加工行数

State state;                               //申明工作状态结构体变量
Speed_Control Speed;                       //声明主轴速度相关的结构体变量
Pram_Status pram_status;                   //声明设置页面相关参数的结构体变量
Control_Panel_Pram control_panel_pram;      //声明控制面板相关参数的结构体变量
Return_Workpiece_Zero return_workpiece_zero;//声明回工件零相关参数的结构体变量
Devide_Set devide_set;                     //声明分中设置相关参数的结构体变量
Jump_Work_Set jump_work_set;               //声明跳行加工相关参数的结构体变量

/******************************************************************************************************/
/*!                                                                                 
*  \brief  程序入口                                                                 
*/ 
/*******************************************************************************************************/
int main()                                                                          
 { 
  uint16 time_conuter=0;	
  uint16 Recdata1,Recdata2;	 
	uint8  check_time=0;      //脉冲同步检查次数
	Set_System();             //配置时钟                                                                                                                                                                                                                                                              
	systicket_init();         //配置时钟节拍
	Usart1_Init(115200);      //串口1初始化(与LCD屏通讯)	 	 
	queue_reset();            //清空串口接收缓冲区 
	TIME2_Init();             //定时器2初始化
	//TIME3_Init();             //定时器3初始化(向主机询问坐标)
  TIME4_Init();             //定时器4初始化(计算手轮脉冲)                                                                                              
	delay_ms(300);            //延时等待串口屏初始化完毕,必须等待300ms  
	Usart3_Init(115200);      //串口3初始化(与雕刻机通讯)
	
	 
	Power_On_Set();                 //串口屏开机动画和参数初始化设置	
	Setting_page_pram_get();        //获取串口屏设置页面相关参数值（保存在flash）	
	Return_last_status();           //恢复上一次串口屏设置页面相关参数值

		//    MCU不要频繁向串口屏发送数据，否则串口屏的内部缓存区会满，从而导致数据丢失(缓冲区大小：标准型8K，基本型4.7K)
		//    1) 一般情况下，控制MCU向串口屏发送数据的周期大于100ms，就可以避免数据丢失的问题；
		//    2) 如果仍然有数据丢失的问题，请判断串口屏的BUSY引脚，为高时不能发送数据给串口屏。
		
//	while(Pulses_check)        //开机同步主机脉冲
//	{
//		if(RX_Data[1] == CMD_UPDATE_MACH3_NUMBER)
//		{
//			check_time++;
//			Recdata1=RX_Data[18];
//			Recdata2=RX_Data[19];	
//			TIM4->CNT = (Recdata1<<8)+Recdata2;  //同步脉冲
//      if(check_time>5)
//        Pulses_check=0;
//			
//      sprintf(Working_line_buf,"%u",Pulses_counter);	
//			SetTextValue(0,22,(uchar *)Working_line_buf);     //显示加工行数，需要向主机询问			
//		}
//	}
	  
		
	while(1)                                                                        
	{
		//time_conuter++;
		
		Pulses_Count();                        //计算手轮脉冲
		Usart3_Receive_Data_handle();          //与雕刻机通讯，处理相关数据 
	
		if(Mark_20ms) 
		{
		  LCD_command_analyse();                 //分析LCD屏的命令 			  
			Mark_20ms=0;
		}
		if(Mark_60ms)                         //定时满60ms
		{
			LCD_Show_coordanate_value();        //显示工件坐标
			Mark_60ms=0;
			
			if(Start_Download)
			{
				time_conuter++;
				if(time_conuter==1)
				{
					time_conuter=0;
					Download_Per++;
				}
		 }
		}
		LCD_handle();                          //处理LCD屏数据
			
    	
//		sprintf(Working_line_buf,"%d",Pulses_counter);  
//		SetTextValue(0,23,(uchar *)Working_line_buf);     //显示加工行数，需要向主机询问
	}  
}





//对来自LCD屏的命令进行分析
void LCD_command_analyse(void)
{
	qsize  size = 0;                                             //指令长度 
  size = queue_find_cmd(cmd_buffer,CMD_MAX_SIZE);              //接收到LCD屏的数据，从USART1的指令缓冲区cmd_buffer中获取一条指令，得到指令长度       
	if(size>0 && cmd_buffer[1]!=0x07)  //接收到指令 ，及判断是否为开机提示
	{                                                                           
		Usart1_Receive_data_handle((PCTRL_MSG)cmd_buffer, size);           //指令分析处理 ，标记应该进入哪个Work_Page_Status，标记相应的操作位
		memset(cmd_buffer, 0, CMD_MAX_SIZE);                       //对指令缓冲cmd_buffer清零
	}
}


//计算首轮脉冲个数
void Pulses_Count(void)
{
	if( Work_Page_Status == Working_Page || Work_Page_Status == ControlPanel_Page )
	{
		if(Pulses_count_mark)
		{
		  TIM_Cmd(TIM4, ENABLE);
			Pulses_count_mark=0;
		}
		Get_Pulses_num();   
		sprintf(Working_line_buf,"%u",Pulses_counter);  
		SetTextValue(0,22,(uchar *)Working_line_buf);     //显示脉冲个数 
	}
	else
	{
	  TIM_Cmd(TIM4, DISABLE);          //禁止 TIM4，脉冲不计数
		Pulses_count_mark=1;
	}
	

