pdxagc/F103_handwheel_control/STM32/DCDEMO7/src/main.c
					}
				}
				//*********************************************************************************************
				if(return_workpiece_zero.A_clear_status==0)  //A轴清零
				{
					Puless_count_clear();
					control_panel_pram.A_value=0;
					control_panel_pram.Temp_save_Avalue=0;					
							
				}
				else
				{
					if(return_workpiece_zero.A_get_value)     //获取到新坐标值
					{
						Puless_count_clear();
						control_panel_pram.A_value = return_workpiece_zero.Re_A_Value;
						control_panel_pram.Temp_save_Avalue = return_workpiece_zero.Re_A_Value;								
						return_workpiece_zero.A_get_value=0;
					}
					else
					{
						Puless_count_clear();                //脉冲计数寄存器清零	
					}
				}
				//*********************************************************************************************
				if(return_workpiece_zero.B_clear_status==0)  //B轴清零
				{
					Puless_count_clear();
					control_panel_pram.B_value = 0;
					control_panel_pram.Temp_save_Bvalue = 0;					
							
				}
				else 
				{
					if(return_workpiece_zero.B_get_value)     //获取到新坐标值
					{
						Puless_count_clear();
						control_panel_pram.B_value = return_workpiece_zero.Re_B_Value;
						control_panel_pram.Temp_save_Bvalue = return_workpiece_zero.Re_B_Value;						
						return_workpiece_zero.B_get_value=0;
					}
					else
					{
						Puless_count_clear();                //脉冲计数寄存器清零	
					}
				}
				
				return_workpiece_zero.Sure=0;				
				Work_Page_Status=ControlPanel_Page;
			} 
			if(return_workpiece_zero.Cancel)        //取消按钮按下
			{
				control_panel_pram.X_value=control_panel_pram.Temp_save_Xvalue;
				control_panel_pram.Y_value=control_panel_pram.Temp_save_Yvalue;
				control_panel_pram.Z_value=control_panel_pram.Temp_save_Zvalue;
				control_panel_pram.A_value=control_panel_pram.Temp_save_Avalue;
				control_panel_pram.B_value=control_panel_pram.Temp_save_Bvalue;					
				Puless_count_clear();                //脉冲计数寄存器清零							
				return_workpiece_zero.Re_X_Value=0;
				return_workpiece_zero.Re_Y_Value=0;
				return_workpiece_zero.Re_Z_Value=0;
				return_workpiece_zero.Re_A_Value=0;
				return_workpiece_zero.Re_B_Value=0;	
				return_workpiece_zero.Cancel=0;
				
			}
			Show_coordinate_on_return_workpiece_zero_page();  //在回工件零页面显示所有轴坐标值				
			
		}
		  break;
		case Jump_Work_Page:     //*****************************************************跳行加工页面****************************************************************************************
		{
			if(jump_work_set.First_get_into)
			{
				sprintf(Working_line_buf,"%d",Working_line);  
				SetTextValue(5,4,(uchar *)Working_line_buf);     //显示上次加工行数 
				SetTextValue(5,3,(uchar *)Working_line_buf);     //显示上次加工行数
				jump_work_set.First_get_into=0;
			}
			
		}
			break;
		case File_Manage_Page:    //*****************************************************文件管理页面****************************************************************************************
		{
		  char buf[20];
		  if(Press_button==CMD_Download)   //下载按钮触发
			{
				Start_Download=1;               //下载标志位置1
				SetButtonValue(6,1,1);    //设值按钮为下载状态
			  SetControState(6,1,0);		 //禁止控件	
				Press_button=0xFF;
			}		
			if(Start_Download)
			{
			   sprintf(buf,"已下载%d%%",Download_Per);
				 SetTextValue(6,38,(uchar *)buf);     //显示下载百分比
				 if(Download_Per==100)
				 {
					 Download_Per=0;
					 Start_Download=0;
					 ClearTextValue(6,38);     //清除文本
					 SetControState(6,1,1);		 //使能控件	
					 SetButtonValue(6,1,0);    //设置值按钮位初始状态
				 }
			}
			if(Press_button==CMD_Cancel_Download)  //发取消下载按钮
			{
				Start_Download=0;
				Download_Per=0;
				ClearTextValue(6,38);     //清除文本
				SetControState(6,1,1);		 //使能控件	
				SetButtonValue(6,1,0);    //设置按钮为初始状态
				Press_button=0xFF;
			
			}
			if(Last_time_Cloud_Page!=Cloud_Page)
			{
			  sprintf(buf,"%u",Cloud_Page);
				SetTextValue(6,20,(uchar *)buf);     //显示第几页
				Last_time_Cloud_Page=Cloud_Page;
			}
			if(Last_time_SD_Page!=SD_Page)
			{
			  sprintf(buf,"%u",SD_Page);
				SetTextValue(6,21,(uchar *)buf);     //显示第几页
				Last_time_SD_Page=SD_Page;
			}
			if(Press_button==CMD_Delete)
			{
			  //sprintf(buf,"%u",SD_Page);
			  SetTextValue(9,3,(uchar *)file_name);     //显示文件名呢
				Press_button=0xFF;
			}
			if(Press_button==CMD_File_Delete_Sure)
			{
			
			}
		
		}
			break;
		case Same_file_Error_Page:    //**************************************************同名文件报错页面****************************************************************************************
			break;
		case Download_Fail_Pgae:    //***************************************************下载失败提醒页面
			break;
		case Delete_Page:         //*****************************************************删除页面****************************************************************************************
		{		}	
		break;
		case Storage_View_Page:    //*****************************************************内存预览页面****************************************************************************************
			break;	
		case Net_Account_Manage_Page:  //**************************************************网络与账户登录管理**********************************************************************************
			{
				if(WiFi_Password_Right==5)
				{
				  Network_Control=3;
					WiFi_Password_Right=0;
				}
				if(Account_Password_Right==5)
				{
					Sign_Control=3;
					Account_Password_Right=0;
				}
				switch(Network_Control)     //网络连接控件显示、隐藏控制
				{
					case 0: break;
					case Show_Disconnect_Network_Control: 
					{
						ShowControl(11,18,1);
						Network_Control=0;
					}break;
					case Hide_Disconnect_Network_Control: 
					{
						ShowControl(11,18,0);
						Network_Control=0;
					}break;				
				}
				//ShowControl(11,4,1);
				switch(Sign_Control)     //账户登录退出控件显示、隐藏控制
				{
					case 0: break;
					case Show_Sign_Out_Control: 
					{
						ShowControl(11,19,1);
						Network_Control=0;
					}break;
					case Hide_Sign_Out_Control: 
					{
						ShowControl(11,19,0);
						Network_Control=0;
					}break;					
				}									
			}
			break;
		case Choose_WiFi_Page:        //*****************************************************选择WiFi页面****************************************************************************************
		{
		  char buf[20];
			if(Last_time_WiFi_Page!=WiFi_Page)
			{
			  sprintf(buf,"%u",WiFi_Page);
				SetTextValue(12,11,(uchar *)buf);     //显示第几页
				Last_time_WiFi_Page=WiFi_Page;
			}	
		}break;
		case Disconnect_Remind_Page: 
			break;
		case SignOut_Remind_Page: 
			break;
		case Cancel_Download_Pgae:
			break;
		default:
			break;
	}

