pdxagc/F103_handwheel_control/STM32/DCDEMO7/src/main.c
							}
							break;
						}
					}
					break;
					case Storage_View_Page: Work_Page_Status=Storage_View_Page;break;   //画面10：内存空间预览页面
					case Net_Account_Manage_Page:                                       //画面11：网络账户管理
					{
						Work_Page_Status=Net_Account_Manage_Page;
						switch(get_control_id)
						{
							case 1: Work_Page_Status=Working_Page;break;
							case 2: Work_Page_Status=File_Manage_Page;break;
							case 3: Work_Page_Status=Choose_WiFi_Page;break;
							case 4: 
							{
							  if(get_button_state)
								{
									WiFi_Password_Right++;								
								}
							
							}break;
							case 5:
							{
							  if(get_button_state)
								{
									Account_Password_Right++;								
								}
							
							}
							default:break;
						}
					}break;
					case Choose_WiFi_Page:                                                 //画面12：选择WiFi
   				{
						Work_Page_Status=Choose_WiFi_Page;
						switch(get_control_id)
						{
							case 1: 
							{
							  Work_Page_Status=Net_Account_Manage_Page;
							}break;
							case 2: 
							{
							  Work_Page_Status=Net_Account_Manage_Page;
							}break;
							case 3: 
							{
							  Work_Page_Status=Net_Account_Manage_Page;
							}break;
							case 4: 
							{
								Work_Page_Status=Net_Account_Manage_Page;
							}break;
							case 5:
							{
							  if(get_button_state)
								{
								    WiFi_Page++;
								}
							}break;
							case 6: 
							{
								if(get_button_state)
								{
									if(WiFi_Page>1)
								    WiFi_Page--;
								}
							}break;
							default:break;
						}
					}break;          
					case Disconnect_Remind_Page:                                            //画面15：断开网络提醒页面
					{
						switch(get_control_id)
						{
							case 1: Network_Control=4;
						}
					}break;     
					case SignOut_Remind_Page:                                                //画面16：退出登录提醒页面
					{
					  switch(get_control_id)
						{
							case 1: Sign_Control=4;
						}
					}	
					break;         
					case Cancel_Download_Pgae:                                                //取消下载提醒
					{
            switch(get_control_id)
						{
							case 1:
							{
							  if(get_button_state)
								{
									Press_button = CMD_Cancel_Download;								
								}
							}
							break;
							case 2: 
							{
							  if(get_button_state)
								{
									Press_button = 0xFF;								
								}
							}
							break;
					  }
					}break;
					case Save_Pram_Page:                                                    //画面21 保存参数设置提醒页面
					{
						Work_Page_Status=Save_Pram_Page;
						if(state.Work_state==Stop)    //停止加工状态
						{
								switch(get_control_id)
								{
									case 1:    //确定按钮触发
									{							
										pram_status.Screen_ID21_Setting_Sure=1;
										pram_status.Screen_ID21_Setting_concel=0;
									}break;
									case 2:   //取消按钮触发
									{
										pram_status.Screen_ID21_Setting_Sure=0;
										pram_status.Screen_ID21_Setting_concel=1;						
									}
									default: break;	
								}
					  }
					}break;
					default: break;						
  			}
        
     }
		 
}


/*! 
*  \brief  文本控件通知
*  \details  当文本通过键盘更新(或调用GetControlValue)时，执行此函数
*  \details  文本控件的内容以字符串形式下发到MCU，如果文本控件内容是浮点值，
*  \details  则需要在此函数中将下发字符串重新转回浮点值。
*  \param str 文本控件内容
*  \pram  value 存放文本内容
*/
float NotifyText(uint8 *str)
{                                                                          
		float value=0;                                                            
		sscanf((char *)str,"%f",&value);            
     return  value;                                                                      
}                                                                                

